Choose a model to use: 
(1.) Cnn1
(2.) Cnn2
(3.) ResNet50
(4.) ResNet50 - Pretrained
Enter a number: 4

Use the full dataset or a smaller one (1:Full or 2:Small): 1

Estimated VRAM usage for the training data: 13.62 GB
Estimated VRAM usage for the training & validation data: 18.16 GB
Load the full dataset into the GPU memory?
(1.) None
(2.) Training data
(3.) Training & Validation data
(4.) Resize the images
Εnter a number: 1
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 150, 150]           9,408
       BatchNorm2d-2         [-1, 64, 150, 150]             128
              ReLU-3         [-1, 64, 150, 150]               0
         MaxPool2d-4           [-1, 64, 75, 75]               0
            Conv2d-5           [-1, 64, 75, 75]           4,096
       BatchNorm2d-6           [-1, 64, 75, 75]             128
              ReLU-7           [-1, 64, 75, 75]               0
            Conv2d-8           [-1, 64, 75, 75]          36,864
       BatchNorm2d-9           [-1, 64, 75, 75]             128
             ReLU-10           [-1, 64, 75, 75]               0
           Conv2d-11          [-1, 256, 75, 75]          16,384
      BatchNorm2d-12          [-1, 256, 75, 75]             512
           Conv2d-13          [-1, 256, 75, 75]          16,384
      BatchNorm2d-14          [-1, 256, 75, 75]             512
             ReLU-15          [-1, 256, 75, 75]               0
       Bottleneck-16          [-1, 256, 75, 75]               0
           Conv2d-17           [-1, 64, 75, 75]          16,384
      BatchNorm2d-18           [-1, 64, 75, 75]             128
             ReLU-19           [-1, 64, 75, 75]               0
           Conv2d-20           [-1, 64, 75, 75]          36,864
      BatchNorm2d-21           [-1, 64, 75, 75]             128
             ReLU-22           [-1, 64, 75, 75]               0
           Conv2d-23          [-1, 256, 75, 75]          16,384
      BatchNorm2d-24          [-1, 256, 75, 75]             512
             ReLU-25          [-1, 256, 75, 75]               0
       Bottleneck-26          [-1, 256, 75, 75]               0
           Conv2d-27           [-1, 64, 75, 75]          16,384
      BatchNorm2d-28           [-1, 64, 75, 75]             128
             ReLU-29           [-1, 64, 75, 75]               0
           Conv2d-30           [-1, 64, 75, 75]          36,864
      BatchNorm2d-31           [-1, 64, 75, 75]             128
             ReLU-32           [-1, 64, 75, 75]               0
           Conv2d-33          [-1, 256, 75, 75]          16,384
      BatchNorm2d-34          [-1, 256, 75, 75]             512
             ReLU-35          [-1, 256, 75, 75]               0
       Bottleneck-36          [-1, 256, 75, 75]               0
           Conv2d-37          [-1, 128, 75, 75]          32,768
      BatchNorm2d-38          [-1, 128, 75, 75]             256
             ReLU-39          [-1, 128, 75, 75]               0
           Conv2d-40          [-1, 128, 38, 38]         147,456
      BatchNorm2d-41          [-1, 128, 38, 38]             256
             ReLU-42          [-1, 128, 38, 38]               0
           Conv2d-43          [-1, 512, 38, 38]          65,536
      BatchNorm2d-44          [-1, 512, 38, 38]           1,024
           Conv2d-45          [-1, 512, 38, 38]         131,072
      BatchNorm2d-46          [-1, 512, 38, 38]           1,024
             ReLU-47          [-1, 512, 38, 38]               0
       Bottleneck-48          [-1, 512, 38, 38]               0
           Conv2d-49          [-1, 128, 38, 38]          65,536
      BatchNorm2d-50          [-1, 128, 38, 38]             256
             ReLU-51          [-1, 128, 38, 38]               0
           Conv2d-52          [-1, 128, 38, 38]         147,456
      BatchNorm2d-53          [-1, 128, 38, 38]             256
             ReLU-54          [-1, 128, 38, 38]               0
           Conv2d-55          [-1, 512, 38, 38]          65,536
      BatchNorm2d-56          [-1, 512, 38, 38]           1,024
             ReLU-57          [-1, 512, 38, 38]               0
       Bottleneck-58          [-1, 512, 38, 38]               0
           Conv2d-59          [-1, 128, 38, 38]          65,536
      BatchNorm2d-60          [-1, 128, 38, 38]             256
             ReLU-61          [-1, 128, 38, 38]               0
           Conv2d-62          [-1, 128, 38, 38]         147,456
      BatchNorm2d-63          [-1, 128, 38, 38]             256
             ReLU-64          [-1, 128, 38, 38]               0
           Conv2d-65          [-1, 512, 38, 38]          65,536
      BatchNorm2d-66          [-1, 512, 38, 38]           1,024
             ReLU-67          [-1, 512, 38, 38]               0
       Bottleneck-68          [-1, 512, 38, 38]               0
           Conv2d-69          [-1, 128, 38, 38]          65,536
      BatchNorm2d-70          [-1, 128, 38, 38]             256
             ReLU-71          [-1, 128, 38, 38]               0
           Conv2d-72          [-1, 128, 38, 38]         147,456
      BatchNorm2d-73          [-1, 128, 38, 38]             256
             ReLU-74          [-1, 128, 38, 38]               0
           Conv2d-75          [-1, 512, 38, 38]          65,536
      BatchNorm2d-76          [-1, 512, 38, 38]           1,024
             ReLU-77          [-1, 512, 38, 38]               0
       Bottleneck-78          [-1, 512, 38, 38]               0
           Conv2d-79          [-1, 256, 38, 38]         131,072
      BatchNorm2d-80          [-1, 256, 38, 38]             512
             ReLU-81          [-1, 256, 38, 38]               0
           Conv2d-82          [-1, 256, 19, 19]         589,824
      BatchNorm2d-83          [-1, 256, 19, 19]             512
             ReLU-84          [-1, 256, 19, 19]               0
           Conv2d-85         [-1, 1024, 19, 19]         262,144
      BatchNorm2d-86         [-1, 1024, 19, 19]           2,048
           Conv2d-87         [-1, 1024, 19, 19]         524,288
      BatchNorm2d-88         [-1, 1024, 19, 19]           2,048
             ReLU-89         [-1, 1024, 19, 19]               0
       Bottleneck-90         [-1, 1024, 19, 19]               0
           Conv2d-91          [-1, 256, 19, 19]         262,144
      BatchNorm2d-92          [-1, 256, 19, 19]             512
             ReLU-93          [-1, 256, 19, 19]               0
           Conv2d-94          [-1, 256, 19, 19]         589,824
      BatchNorm2d-95          [-1, 256, 19, 19]             512
             ReLU-96          [-1, 256, 19, 19]               0
           Conv2d-97         [-1, 1024, 19, 19]         262,144
      BatchNorm2d-98         [-1, 1024, 19, 19]           2,048
             ReLU-99         [-1, 1024, 19, 19]               0
      Bottleneck-100         [-1, 1024, 19, 19]               0
          Conv2d-101          [-1, 256, 19, 19]         262,144
     BatchNorm2d-102          [-1, 256, 19, 19]             512
            ReLU-103          [-1, 256, 19, 19]               0
          Conv2d-104          [-1, 256, 19, 19]         589,824
     BatchNorm2d-105          [-1, 256, 19, 19]             512
            ReLU-106          [-1, 256, 19, 19]               0
          Conv2d-107         [-1, 1024, 19, 19]         262,144
     BatchNorm2d-108         [-1, 1024, 19, 19]           2,048
            ReLU-109         [-1, 1024, 19, 19]               0
      Bottleneck-110         [-1, 1024, 19, 19]               0
          Conv2d-111          [-1, 256, 19, 19]         262,144
     BatchNorm2d-112          [-1, 256, 19, 19]             512
            ReLU-113          [-1, 256, 19, 19]               0
          Conv2d-114          [-1, 256, 19, 19]         589,824
     BatchNorm2d-115          [-1, 256, 19, 19]             512
            ReLU-116          [-1, 256, 19, 19]               0
          Conv2d-117         [-1, 1024, 19, 19]         262,144
     BatchNorm2d-118         [-1, 1024, 19, 19]           2,048
            ReLU-119         [-1, 1024, 19, 19]               0
      Bottleneck-120         [-1, 1024, 19, 19]               0
          Conv2d-121          [-1, 256, 19, 19]         262,144
     BatchNorm2d-122          [-1, 256, 19, 19]             512
            ReLU-123          [-1, 256, 19, 19]               0
          Conv2d-124          [-1, 256, 19, 19]         589,824
     BatchNorm2d-125          [-1, 256, 19, 19]             512
            ReLU-126          [-1, 256, 19, 19]               0
          Conv2d-127         [-1, 1024, 19, 19]         262,144
     BatchNorm2d-128         [-1, 1024, 19, 19]           2,048
            ReLU-129         [-1, 1024, 19, 19]               0
      Bottleneck-130         [-1, 1024, 19, 19]               0
          Conv2d-131          [-1, 256, 19, 19]         262,144
     BatchNorm2d-132          [-1, 256, 19, 19]             512
            ReLU-133          [-1, 256, 19, 19]               0
          Conv2d-134          [-1, 256, 19, 19]         589,824
     BatchNorm2d-135          [-1, 256, 19, 19]             512
            ReLU-136          [-1, 256, 19, 19]               0
          Conv2d-137         [-1, 1024, 19, 19]         262,144
     BatchNorm2d-138         [-1, 1024, 19, 19]           2,048
            ReLU-139         [-1, 1024, 19, 19]               0
      Bottleneck-140         [-1, 1024, 19, 19]               0
          Conv2d-141          [-1, 512, 19, 19]         524,288
     BatchNorm2d-142          [-1, 512, 19, 19]           1,024
            ReLU-143          [-1, 512, 19, 19]               0
          Conv2d-144          [-1, 512, 10, 10]       2,359,296
     BatchNorm2d-145          [-1, 512, 10, 10]           1,024
            ReLU-146          [-1, 512, 10, 10]               0
          Conv2d-147         [-1, 2048, 10, 10]       1,048,576
     BatchNorm2d-148         [-1, 2048, 10, 10]           4,096
          Conv2d-149         [-1, 2048, 10, 10]       2,097,152
     BatchNorm2d-150         [-1, 2048, 10, 10]           4,096
            ReLU-151         [-1, 2048, 10, 10]               0
      Bottleneck-152         [-1, 2048, 10, 10]               0
          Conv2d-153          [-1, 512, 10, 10]       1,048,576
     BatchNorm2d-154          [-1, 512, 10, 10]           1,024
            ReLU-155          [-1, 512, 10, 10]               0
          Conv2d-156          [-1, 512, 10, 10]       2,359,296
     BatchNorm2d-157          [-1, 512, 10, 10]           1,024
            ReLU-158          [-1, 512, 10, 10]               0
          Conv2d-159         [-1, 2048, 10, 10]       1,048,576
     BatchNorm2d-160         [-1, 2048, 10, 10]           4,096
            ReLU-161         [-1, 2048, 10, 10]               0
      Bottleneck-162         [-1, 2048, 10, 10]               0
          Conv2d-163          [-1, 512, 10, 10]       1,048,576
     BatchNorm2d-164          [-1, 512, 10, 10]           1,024
            ReLU-165          [-1, 512, 10, 10]               0
          Conv2d-166          [-1, 512, 10, 10]       2,359,296
     BatchNorm2d-167          [-1, 512, 10, 10]           1,024
            ReLU-168          [-1, 512, 10, 10]               0
          Conv2d-169         [-1, 2048, 10, 10]       1,048,576
     BatchNorm2d-170         [-1, 2048, 10, 10]           4,096
            ReLU-171         [-1, 2048, 10, 10]               0
      Bottleneck-172         [-1, 2048, 10, 10]               0
AdaptiveAvgPool2d-173           [-1, 2048, 1, 1]               0
          Linear-174                 [-1, 1000]       2,049,000
================================================================
Total params: 25,557,032
Trainable params: 25,557,032
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 1.02
Forward/backward pass size (MB): 523.62
Params size (MB): 97.49
Estimated Total Size (MB): 622.14
----------------------------------------------------------------
Starting training
=========== Epoch: 1 ===========
	[Batch:  19]: Loss = 1.305
	[Batch:  38]: Loss = 0.357
	[Batch:  57]: Loss = 0.296
	[Batch:  76]: Loss = 0.307
	[Batch:  95]: Loss = 0.267
	[Batch: 114]: Loss = 0.250
	[Batch: 133]: Loss = 0.271
	[Batch: 152]: Loss = 0.247
	[Batch: 171]: Loss = 0.229
	[Batch: 190]: Loss = 0.237
Train Loss: 0.37,	Validation Loss: 0.27
Train Accuracy: 88.37%,	Validation Accuracy: 89.02%

=========== Epoch: 2 ===========
	[Batch:  19]: Loss = 0.195
	[Batch:  38]: Loss = 0.208
	[Batch:  57]: Loss = 0.169
	[Batch:  76]: Loss = 0.190
	[Batch:  95]: Loss = 0.166
	[Batch: 114]: Loss = 0.198
	[Batch: 133]: Loss = 0.191
	[Batch: 152]: Loss = 0.228
	[Batch: 171]: Loss = 0.186
	[Batch: 190]: Loss = 0.191
Train Loss: 0.19,	Validation Loss: 0.31
Train Accuracy: 93.04%,	Validation Accuracy: 87.80%

=========== Epoch: 3 ===========
	[Batch:  19]: Loss = 0.170
	[Batch:  38]: Loss = 0.200
	[Batch:  57]: Loss = 0.167
	[Batch:  76]: Loss = 0.178
	[Batch:  95]: Loss = 0.164
	[Batch: 114]: Loss = 0.160
	[Batch: 133]: Loss = 0.177
	[Batch: 152]: Loss = 0.162
	[Batch: 171]: Loss = 0.176
	[Batch: 190]: Loss = 0.118
Train Loss: 0.17,	Validation Loss: 0.87
Train Accuracy: 93.68%,	Validation Accuracy: 72.13%

=========== Epoch: 4 ===========
	[Batch:  19]: Loss = 0.106
	[Batch:  38]: Loss = 0.144
	[Batch:  57]: Loss = 0.140
	[Batch:  76]: Loss = 0.132
	[Batch:  95]: Loss = 0.136
	[Batch: 114]: Loss = 0.160
	[Batch: 133]: Loss = 0.161
	[Batch: 152]: Loss = 0.137
	[Batch: 171]: Loss = 0.194
	[Batch: 190]: Loss = 0.161
Train Loss: 0.15,	Validation Loss: 0.20
Train Accuracy: 94.36%,	Validation Accuracy: 92.12%

=========== Epoch: 5 ===========
	[Batch:  19]: Loss = 0.095
	[Batch:  38]: Loss = 0.093
	[Batch:  57]: Loss = 0.142
	[Batch:  76]: Loss = 0.102
	[Batch:  95]: Loss = 0.118
	[Batch: 114]: Loss = 0.104
	[Batch: 133]: Loss = 0.097
	[Batch: 152]: Loss = 0.114
	[Batch: 171]: Loss = 0.112
	[Batch: 190]: Loss = 0.120
Train Loss: 0.11,	Validation Loss: 0.19
Train Accuracy: 95.66%,	Validation Accuracy: 92.40%

Accuracy: 91.25%, Avg. Loss: 0.20
tensor([[ 272,    0,    2,    3],
        [   2, 1074,  109,   25],
        [  19,  114, 1899,   19],
        [   5,    5,   17,  668]])